Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
 Parameters = {
                  - DatabaseName = {
                      - Type = "String"
                    }
                  - TableName    = {
                      - Type = "String"
                    }
                }
              - Resources  = {
                  - SBeaconTermsGlueCatalogTable = {
                      - Properties = {
                          - CatalogId    = {
                              - Ref = "AWS::AccountId"
                            }
                          - DatabaseName = {
                              - Ref = "DatabaseName"
                            }
                          - TableInput   = {
                              - Name              = {
                                  - Ref = "TableName"
                                }
                              - Parameters        = {
                                  - EXTERNAL       = "TRUE"
                                  - numFiles       = "-1"
                                  - "orc.compress" = "SNAPPY"
                                }
                              - PartitionKeys     = [
                                  - {
                                      - Comment = "partition by kind"
                                      - Name    = "kind"
                                      - Type    = "string"
                                    },
                                ]
                              - StorageDescriptor = {
                                  - Columns      = [
                                      - {
                                          - Name = "id"
                                          - Type = "string"
                                        },
                                      - {
                                          - Name = "term"
                                          - Type = "string"
                                        },
                                      - {
                                          - Name = "_projectname"
                                          - Type = "string"
                                        },
                                    ]
                                  - InputFormat  = "org.apache.hadoop.hive.ql.io.orc.OrcInputFormat"
                                  - Location     = "s3://gaspi-metadata-20250110044708770100000001/terms-index"
                                  - OutputFormat = "org.apache.hadoop.hive.ql.io.orc.OrcOutputFormat"
                                  - SerdeInfo    = {
                                      - Name                 = "ORC"
                                      - Parameters           = {
                                          - "hive.orc.use-column-names" = "TRUE"
                                          - "orc.column.index.access"   = "FALSE"
                                          - "serialization.format"      = "1"
                                        }
                                      - SerializationLibrary = "org.apache.hadoop.hive.ql.io.orc.OrcSerde"
                                    }
                                }
                              - TableType         = "EXTERNAL_TABLE"
                            }
                        }
                      - Type       = "AWS::Glue::Table"
                    }
                }
            }
        ) -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.sbeacon.aws_cloudformation_stack.sbeacon_terms_stack will be updated in-place
  ~ resource "aws_cloudformation_stack" "sbeacon_terms_stack" {
        id                 = "arn:aws:cloudformation:ap-southeast-3:307946671795:stack/sbeacon-terms-stack/596c4370-b206-11ef-b6b3-0ef89e602338"
        name               = "sbeacon-terms-stack"
      ~ outputs            = {} -> (known after apply)
        tags               = {}
      ~ template_body      = jsonencode(
            {
              - Parameters = {
                  - DatabaseName = {
                      - Type = "String"
                    }
                  - TableName    = {
                      - Type = "String"
                    }
                }
              - Resources  = {
                  - SBeaconTermsGlueCatalogTable = {
                      - Properties = {
                          - CatalogId    = {
                              - Ref = "AWS::AccountId"
                            }
                          - DatabaseName = {
                              - Ref = "DatabaseName"
                            }
                          - TableInput   = {
                              - Name              = {
                                  - Ref = "TableName"
                                }
                              - Parameters        = {
                                  - EXTERNAL       = "TRUE"
                                  - numFiles       = "-1"
                                  - "orc.compress" = "SNAPPY"
                                }
                              - PartitionKeys     = [
                                  - {
                                      - Comment = "partition by kind"
                                      - Name    = "kind"
                                      - Type    = "string"
                                    },
                                ]
                              - StorageDescriptor = {
                                  - Columns      = [
                                      - {
                                          - Name = "term"
                                          - Type = "string"
                                        },
                                      - {
                                          - Name = "label"
                                          - Type = "string"
                                        },
                                      - {
                                          - Name = "type"
                                          - Type = "string"
                                        },
                                      - {
                                          - Name = "_projectname"
                                          - Type = "string"
                                        },
                                    ]
                                  - InputFormat  = "org.apache.hadoop.hive.ql.io.orc.OrcInputFormat"
                                  - Location     = "s3://gaspi-metadata-20250110044708770100000001/terms"
                                  - OutputFormat = "org.apache.hadoop.hive.ql.io.orc.OrcOutputFormat"
                                  - SerdeInfo    = {
                                      - Name                 = "ORC"
                                      - Parameters           = {
                                          - "hive.orc.use-column-names" = "TRUE"
                                          - "orc.column.index.access"   = "FALSE"
                                          - "serialization.format"      = "1"
                                        }
                                      - SerializationLibrary = "org.apache.hadoop.hive.ql.io.orc.OrcSerde"
                                    }
                                }
                              - TableType         = "EXTERNAL_TABLE"
                            }
                        }
                      - Type       = "AWS::Glue::Table"
                    }
                }
            }
        ) -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-analyses will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-analyses" {
        id                 = "307946671795:sbeacon_metadata:sbeacon_analyses"
        name               = "sbeacon_analyses"
        # (10 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ location                  = "s3://gaspi-metadata-20250110044708770100000001/analyses" -> (known after apply)
            # (8 unchanged attributes hidden)

            # (14 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-analyses-cache will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-analyses-cache" {
        id                 = "307946671795:sbeacon_metadata:sbeacon_analyses_cache"
        name               = "sbeacon_analyses_cache"
        # (10 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ location                  = "s3://gaspi-metadata-20250110044708770100000001/analyses-cache" -> (known after apply)
            # (8 unchanged attributes hidden)

            # (14 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-biosamples will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-biosamples" {
        id                 = "307946671795:sbeacon_metadata:sbeacon_biosamples"
        name               = "sbeacon_biosamples"
        # (10 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ location                  = "s3://gaspi-metadata-20250110044708770100000001/biosamples" -> (known after apply)
            # (8 unchanged attributes hidden)

            # (23 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-biosamples-cache will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-biosamples-cache" {
        id                 = "307946671795:sbeacon_metadata:sbeacon_biosamples_cache"
        name               = "sbeacon_biosamples_cache"
        # (10 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ location                  = "s3://gaspi-metadata-20250110044708770100000001/biosamples-cache" -> (known after apply)
            # (8 unchanged attributes hidden)

            # (23 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-datasets will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-datasets" {
        id                 = "307946671795:sbeacon_metadata:sbeacon_datasets"
        name               = "sbeacon_datasets"
        # (10 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ location                  = "s3://gaspi-metadata-20250110044708770100000001/datasets" -> (known after apply)
            # (8 unchanged attributes hidden)

            # (15 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-datasets-cache will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-datasets-cache" {
        id                 = "307946671795:sbeacon_metadata:sbeacon_datasets_cache"
        name               = "sbeacon_datasets_cache"
        # (10 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ location                  = "s3://gaspi-metadata-20250110044708770100000001/datasets-cache" -> (known after apply)
            # (8 unchanged attributes hidden)

            # (15 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-individuals will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-individuals" {
        id                 = "307946671795:sbeacon_metadata:sbeacon_individuals"
        name               = "sbeacon_individuals"
        # (10 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ location                  = "s3://gaspi-metadata-20250110044708770100000001/individuals" -> (known after apply)
            # (8 unchanged attributes hidden)

            # (16 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-individuals-cache will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-individuals-cache" {
        id                 = "307946671795:sbeacon_metadata:sbeacon_individuals_cache"
        name               = "sbeacon_individuals_cache"
        # (10 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ location                  = "s3://gaspi-metadata-20250110044708770100000001/individuals-cache" -> (known after apply)
            # (8 unchanged attributes hidden)

            # (16 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-relations will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-relations" {
        id                 = "307946671795:sbeacon_metadata:sbeacon_relations"
        name               = "sbeacon_relations"
        # (10 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ location                  = "s3://gaspi-metadata-20250110044708770100000001/relations" -> (known after apply)
            # (8 unchanged attributes hidden)

            # (6 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-runs will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-runs" {
        id                 = "307946671795:sbeacon_metadata:sbeacon_runs"
        name               = "sbeacon_runs"
        # (10 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ location                  = "s3://gaspi-metadata-20250110044708770100000001/runs" -> (known after apply)
            # (8 unchanged attributes hidden)

            # (14 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-runs-cache will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-runs-cache" {
        id                 = "307946671795:sbeacon_metadata:sbeacon_runs_cache"
        name               = "sbeacon_runs_cache"
        # (10 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ location                  = "s3://gaspi-metadata-20250110044708770100000001/runs-cache" -> (known after apply)
            # (8 unchanged attributes hidden)

            # (14 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-terms-cache will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-terms-cache" {
        id                 = "307946671795:sbeacon_metadata:sbeacon_terms_cache"
        name               = "sbeacon_terms_cache"
        # (10 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ location                  = "s3://gaspi-metadata-20250110044708770100000001/terms-cache" -> (known after apply)
            # (8 unchanged attributes hidden)

            # (7 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_iam_policy.extra-glue-policy will be updated in-place
  ~ resource "aws_iam_policy" "extra-glue-policy" {
        id               = "arn:aws:iam::307946671795:policy/extra-glue-policy"
        name             = "extra-glue-policy"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:ListBucket",
                          - "s3:ListAllMyBuckets",
                          - "s3:GetObject",
                          - "s3:GetBucketLocation",
                          - "s3:GetBucketAcl",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::gaspi-metadata-20250110044708770100000001/*",
                          - "arn:aws:s3:::gaspi-metadata-20250110044708770100000001",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.aws_iam_role_policy.ec2_deidentification_policy will be updated in-place
  ~ resource "aws_iam_role_policy" "ec2_deidentification_policy" {
        id          = "sbeacon_backend_ec2_deidentification_instance_role:sbeacon_backend_ec2_deidentification_policy"
        name        = "sbeacon_backend_ec2_deidentification_policy"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:ListBucket"
                      - Condition = {
                          - StringLike = {
                              - "s3:prefix" = [
                                  - "projects/*/project-files/*",
                                  - "staging/projects/*/project-files/*",
                                ]
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "arn:aws:s3:::gaspi-dataportal-20250110044710445000000002"
                    },
                  - {
                      - Action   = [
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal-20250110044710445000000002/staging/projects/*/project-files/*"
                    },
                  - {
                      - Action   = "s3:PutObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal-20250110044710445000000002/projects/*/project-files/*"
                    },
                  - {
                      - Action   = "dynamodb:UpdateItem"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-vcfs",
                          - "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-projects",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.aws_lambda_layer_version.binaries_layer must be replaced
+/- resource "aws_lambda_layer_version" "binaries_layer" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_binaries_layer:46" -> (known after apply)
      ~ code_sha256                 = "C59gD3HZFxMNpT5ezWVWErHOJhUxYgc/qBTZVSUkKd8=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-06-04T02:16:57.950+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_binaries_layer:46" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_binaries_layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "Uw1w0f/aO45ErVDpnsw4dExWwS1sXzlR60+wUjCpctk0uK5Rftx29IiSj3Ln/x1JsbKUh5xc6bNRsAUdAyCgQQ==" -> "f5hTpymQdi+CFeJzNy6YiZIJJPx0KEqwEvGqKVvYBfdOi/UI53ROuHs0zvTXIZDFNWwzUciUeto1/1xTeMC5Dg==" # forces replacement
      ~ source_code_size            = 18105217 -> (known after apply)
      ~ version                     = "46" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_lambda_permission.S3deidentifyFiles must be replaced
-/+ resource "aws_lambda_permission" "S3deidentifyFiles" {
      ~ id                  = "SBeaconBackendAllowS3deidentifyFilesInvoke" -> (known after apply)
      ~ source_arn          = "arn:aws:s3:::gaspi-dataportal-20250110044710445000000002" -> (known after apply) # forces replacement
      + statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.sbeacon.aws_lambda_permission.S3updateFiles must be replaced
-/+ resource "aws_lambda_permission" "S3updateFiles" {
      ~ id                  = "SBeaconBackendAllowS3updateFilesInvoke" -> (known after apply)
      ~ source_arn          = "arn:aws:s3:::gaspi-dataportal-20250110044710445000000002" -> (known after apply) # forces replacement
      + statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.sbeacon.aws_s3_bucket.dataportal-bucket must be replaced
+/- resource "aws_s3_bucket" "dataportal-bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::gaspi-dataportal-20250110044710445000000002" -> (known after apply)
      ~ bucket                      = "gaspi-dataportal-20250110044710445000000002" -> (known after apply)
      ~ bucket_domain_name          = "gaspi-dataportal-20250110044710445000000002.s3.amazonaws.com" -> (known after apply)
      ~ bucket_prefix               = "gaspi-dataportal-" -> "gasi-dataportal-" # forces replacement
      ~ bucket_regional_domain_name = "gaspi-dataportal-20250110044710445000000002.s3.ap-southeast-3.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z01846753K324LI26A3VV" -> (known after apply)
      ~ id                          = "gaspi-dataportal-20250110044710445000000002" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      + policy                      = (known after apply)
      ~ region                      = "ap-southeast-3" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
        tags                        = {
            "Environment" = "dev"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (2 unchanged attributes hidden)

      ~ cors_rule (known after apply)
      - cors_rule {
          - allowed_headers = [
              - "*",
            ] -> null
          - allowed_methods = [
              - "POST",
              - "GET",
              - "HEAD",
              - "DELETE",
              - "PUT",
            ] -> null
          - allowed_origins = [
              - "*",
            ] -> null
          - expose_headers  = [
              - "x-amz-multipart-parts-count",
              - "x-amz-abort-date",
              - "ETag",
            ] -> null
          - max_age_seconds = 36000 -> null
        }

      ~ grant (known after apply)
      - grant {
          - id          = "b9eb83142918f96feca37fee9484dc1260d3eb9733340bfc7df1fcb9c8760675" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
            # (1 unchanged attribute hidden)
        }

      ~ lifecycle_rule (known after apply)
      - lifecycle_rule {
          - abort_incomplete_multipart_upload_days = 0 -> null
          - enabled                                = true -> null
          - id                                     = "remove-zombie-staging-files" -> null
          - prefix                                 = "staging/" -> null
          - tags                                   = {} -> null

          - expiration {
              - days                         = 3 -> null
              - expired_object_delete_marker = false -> null
                # (1 unchanged attribute hidden)
            }
        }
      - lifecycle_rule {
          - abort_incomplete_multipart_upload_days = 0 -> null
          - enabled                                = true -> null
          - id                                     = "expire-noncurrent-versions" -> null
          - prefix                                 = "staging/" -> null
          - tags                                   = {} -> null

          - noncurrent_version_expiration {
              - days = 1 -> null
            }
        }

      ~ logging (known after apply)

      ~ object_lock_configuration (known after apply)

      ~ replication_configuration (known after apply)

      ~ server_side_encryption_configuration (known after apply)
      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

      ~ versioning (known after apply)
      - versioning {
          - enabled    = true -> null
          - mfa_delete = false -> null
        }

      ~ website (known after apply)
    }

  # module.sbeacon.aws_s3_bucket.lambda-layers-bucket must be replaced
+/- resource "aws_s3_bucket" "lambda-layers-bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::gaspi-lambda-layers-20250110044710445300000003" -> (known after apply)
      ~ bucket                      = "gaspi-lambda-layers-20250110044710445300000003" -> (known after apply)
      ~ bucket_domain_name          = "gaspi-lambda-layers-20250110044710445300000003.s3.amazonaws.com" -> (known after apply)
      ~ bucket_prefix               = "gaspi-lambda-layers-" -> "gasi-lambda-layers-" # forces replacement
      ~ bucket_regional_domain_name = "gaspi-lambda-layers-20250110044710445300000003.s3.ap-southeast-3.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z01846753K324LI26A3VV" -> (known after apply)
      ~ id                          = "gaspi-lambda-layers-20250110044710445300000003" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      + policy                      = (known after apply)
      ~ region                      = "ap-southeast-3" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
        tags                        = {
            "Environment" = "dev"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (2 unchanged attributes hidden)

      ~ cors_rule (known after apply)

      ~ grant (known after apply)
      - grant {
          - id          = "b9eb83142918f96feca37fee9484dc1260d3eb9733340bfc7df1fcb9c8760675" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
            # (1 unchanged attribute hidden)
        }

      ~ lifecycle_rule (known after apply)

      ~ logging (known after apply)

      ~ object_lock_configuration (known after apply)

      ~ replication_configuration (known after apply)

      ~ server_side_encryption_configuration (known after apply)
      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

      ~ versioning (known after apply)
      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }

      ~ website (known after apply)
    }

  # module.sbeacon.aws_s3_bucket.metadata-bucket must be replaced
+/- resource "aws_s3_bucket" "metadata-bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::gaspi-metadata-20250110044708770100000001" -> (known after apply)
      ~ bucket                      = "gaspi-metadata-20250110044708770100000001" -> (known after apply)
      ~ bucket_domain_name          = "gaspi-metadata-20250110044708770100000001.s3.amazonaws.com" -> (known after apply)
      ~ bucket_prefix               = "gaspi-metadata-" -> "gasi-metadata-" # forces replacement
      ~ bucket_regional_domain_name = "gaspi-metadata-20250110044708770100000001.s3.ap-southeast-3.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z01846753K324LI26A3VV" -> (known after apply)
      ~ id                          = "gaspi-metadata-20250110044708770100000001" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      + policy                      = (known after apply)
      ~ region                      = "ap-southeast-3" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
        tags                        = {
            "Environment" = "dev"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (2 unchanged attributes hidden)

      ~ cors_rule (known after apply)
      - cors_rule {
          - allowed_headers = [
              - "*",
            ] -> null
          - allowed_methods = [
              - "GET",
              - "HEAD",
            ] -> null
          - allowed_origins = [
              - "*",
            ] -> null
          - expose_headers  = [] -> null
          - max_age_seconds = 3000 -> null
        }

      ~ grant (known after apply)
      - grant {
          - id          = "b9eb83142918f96feca37fee9484dc1260d3eb9733340bfc7df1fcb9c8760675" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
            # (1 unchanged attribute hidden)
        }

      ~ lifecycle_rule (known after apply)
      - lifecycle_rule {
          - abort_incomplete_multipart_upload_days = 0 -> null
          - enabled                                = true -> null
          - id                                     = "clean-old-query-results" -> null
          - prefix                                 = "query-results/" -> null
          - tags                                   = {} -> null

          - expiration {
              - days                         = 2 -> null
              - expired_object_delete_marker = false -> null
                # (1 unchanged attribute hidden)
            }
        }
      - lifecycle_rule {
          - abort_incomplete_multipart_upload_days = 0 -> null
          - enabled                                = true -> null
          - id                                     = "clean-old-cached-results" -> null
          - prefix                                 = "query-responses/" -> null
          - tags                                   = {} -> null

          - expiration {
              - days                         = 2 -> null
              - expired_object_delete_marker = false -> null
                # (1 unchanged attribute hidden)
            }
        }

      ~ logging (known after apply)

      ~ object_lock_configuration (known after apply)

      ~ replication_configuration (known after apply)

      ~ server_side_encryption_configuration (known after apply)
      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

      ~ versioning (known after apply)
      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }

      ~ website (known after apply)
    }

  # module.sbeacon.aws_s3_bucket.variants-bucket must be replaced
+/- resource "aws_s3_bucket" "variants-bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::gaspi-variants-20250110044711919900000004" -> (known after apply)
      ~ bucket                      = "gaspi-variants-20250110044711919900000004" -> (known after apply)
      ~ bucket_domain_name          = "gaspi-variants-20250110044711919900000004.s3.amazonaws.com" -> (known after apply)
      ~ bucket_prefix               = "gaspi-variants-" -> "gasi-variants-" # forces replacement
      ~ bucket_regional_domain_name = "gaspi-variants-20250110044711919900000004.s3.ap-southeast-3.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z01846753K324LI26A3VV" -> (known after apply)
      ~ id                          = "gaspi-variants-20250110044711919900000004" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      + policy                      = (known after apply)
      ~ region                      = "ap-southeast-3" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
        tags                        = {
            "Environment" = "dev"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (2 unchanged attributes hidden)

      ~ cors_rule (known after apply)

      ~ grant (known after apply)
      - grant {
          - id          = "b9eb83142918f96feca37fee9484dc1260d3eb9733340bfc7df1fcb9c8760675" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
            # (1 unchanged attribute hidden)
        }

      ~ lifecycle_rule (known after apply)
      - lifecycle_rule {
          - abort_incomplete_multipart_upload_days = 0 -> null
          - enabled                                = true -> null
          - id                                     = "clean-old-queries" -> null
          - prefix                                 = "variant-queries/" -> null
          - tags                                   = {} -> null

          - expiration {
              - days                         = 1 -> null
              - expired_object_delete_marker = false -> null
                # (1 unchanged attribute hidden)
            }
        }

      ~ logging (known after apply)

      ~ object_lock_configuration (known after apply)

      ~ replication_configuration (known after apply)

      ~ server_side_encryption_configuration (known after apply)
      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

      ~ versioning (known after apply)
      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }

      ~ website (known after apply)
    }

  # module.sbeacon.aws_s3_bucket_acl.dataportal_bucket_acl must be replaced
-/+ resource "aws_s3_bucket_acl" "dataportal_bucket_acl" {
      ~ bucket                = "gaspi-dataportal-20250110044710445000000002" -> (known after apply) # forces replacement
      ~ id                    = "gaspi-dataportal-20250110044710445000000002,private" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ access_control_policy (known after apply)
      - access_control_policy {
          - grant {
              - permission = "FULL_CONTROL" -> null

              - grantee {
                  - id            = "b9eb83142918f96feca37fee9484dc1260d3eb9733340bfc7df1fcb9c8760675" -> null
                  - type          = "CanonicalUser" -> null
                    # (3 unchanged attributes hidden)
                }
            }
          - owner {
              - id           = "b9eb83142918f96feca37fee9484dc1260d3eb9733340bfc7df1fcb9c8760675" -> null
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.sbeacon.aws_s3_bucket_acl.lambda-layers must be replaced
-/+ resource "aws_s3_bucket_acl" "lambda-layers" {
      ~ bucket                = "gaspi-lambda-layers-20250110044710445300000003" -> (known after apply) # forces replacement
      ~ id                    = "gaspi-lambda-layers-20250110044710445300000003,private" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ access_control_policy (known after apply)
      - access_control_policy {
          - grant {
              - permission = "FULL_CONTROL" -> null

              - grantee {
                  - id            = "b9eb83142918f96feca37fee9484dc1260d3eb9733340bfc7df1fcb9c8760675" -> null
                  - type          = "CanonicalUser" -> null
                    # (3 unchanged attributes hidden)
                }
            }
          - owner {
              - id           = "b9eb83142918f96feca37fee9484dc1260d3eb9733340bfc7df1fcb9c8760675" -> null
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.sbeacon.aws_s3_bucket_acl.metadata must be replaced
-/+ resource "aws_s3_bucket_acl" "metadata" {
      ~ bucket                = "gaspi-metadata-20250110044708770100000001" -> (known after apply) # forces replacement
      ~ id                    = "gaspi-metadata-20250110044708770100000001,private" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ access_control_policy (known after apply)
      - access_control_policy {
          - grant {
              - permission = "FULL_CONTROL" -> null

              - grantee {
                  - id            = "b9eb83142918f96feca37fee9484dc1260d3eb9733340bfc7df1fcb9c8760675" -> null
                  - type          = "CanonicalUser" -> null
                    # (3 unchanged attributes hidden)
                }
            }
          - owner {
              - id           = "b9eb83142918f96feca37fee9484dc1260d3eb9733340bfc7df1fcb9c8760675" -> null
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.sbeacon.aws_s3_bucket_acl.variants_bucket_acl must be replaced
-/+ resource "aws_s3_bucket_acl" "variants_bucket_acl" {
      ~ bucket                = "gaspi-variants-20250110044711919900000004" -> (known after apply) # forces replacement
      ~ id                    = "gaspi-variants-20250110044711919900000004,private" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ access_control_policy (known after apply)
      - access_control_policy {
          - grant {
              - permission = "FULL_CONTROL" -> null

              - grantee {
                  - id            = "b9eb83142918f96feca37fee9484dc1260d3eb9733340bfc7df1fcb9c8760675" -> null
                  - type          = "CanonicalUser" -> null
                    # (3 unchanged attributes hidden)
                }
            }
          - owner {
              - id           = "b9eb83142918f96feca37fee9484dc1260d3eb9733340bfc7df1fcb9c8760675" -> null
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.sbeacon.aws_s3_bucket_cors_configuration.dataportal-bucket must be replaced
-/+ resource "aws_s3_bucket_cors_configuration" "dataportal-bucket" {
      ~ bucket                = "gaspi-dataportal-20250110044710445000000002" -> (known after apply) # forces replacement
      ~ id                    = "gaspi-dataportal-20250110044710445000000002" -> (known after apply)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.sbeacon.aws_s3_bucket_cors_configuration.metadata-bucket must be replaced
-/+ resource "aws_s3_bucket_cors_configuration" "metadata-bucket" {
      ~ bucket                = "gaspi-metadata-20250110044708770100000001" -> (known after apply) # forces replacement
      ~ id                    = "gaspi-metadata-20250110044708770100000001" -> (known after apply)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.sbeacon.aws_s3_bucket_lifecycle_configuration.metadata_bucket_lifecycle must be replaced
-/+ resource "aws_s3_bucket_lifecycle_configuration" "metadata_bucket_lifecycle" {
      ~ bucket                                 = "gaspi-metadata-20250110044708770100000001" -> (known after apply) # forces replacement
      + expected_bucket_owner                  = (known after apply)
      ~ id                                     = "gaspi-metadata-20250110044708770100000001" -> (known after apply)
        # (1 unchanged attribute hidden)

        # (2 unchanged blocks hidden)
    }

  # module.sbeacon.aws_s3_bucket_lifecycle_configuration.staging_bucket_lifecycle must be replaced
-/+ resource "aws_s3_bucket_lifecycle_configuration" "staging_bucket_lifecycle" {
      ~ bucket                                 = "gaspi-dataportal-20250110044710445000000002" -> (known after apply) # forces replacement
      + expected_bucket_owner                  = (known after apply)
      ~ id                                     = "gaspi-dataportal-20250110044710445000000002" -> (known after apply)
        # (1 unchanged attribute hidden)

        # (2 unchanged blocks hidden)
    }

  # module.sbeacon.aws_s3_bucket_lifecycle_configuration.variants_bucket_lifecycle must be replaced
-/+ resource "aws_s3_bucket_lifecycle_configuration" "variants_bucket_lifecycle" {
      ~ bucket                                 = "gaspi-variants-20250110044711919900000004" -> (known after apply) # forces replacement
      + expected_bucket_owner                  = (known after apply)
      ~ id                                     = "gaspi-variants-20250110044711919900000004" -> (known after apply)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.sbeacon.aws_s3_bucket_notification.updateFiles must be replaced
-/+ resource "aws_s3_bucket_notification" "updateFiles" {
      ~ bucket      = "gaspi-dataportal-20250110044710445000000002" -> (known after apply) # forces replacement
      ~ id          = "gaspi-dataportal-20250110044710445000000002" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ lambda_function {
          ~ id                  = "tf-s3-lambda-20250110044820597700000007" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
      ~ lambda_function {
          ~ id                  = "tf-s3-lambda-20250110044820597700000008" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
    }

  # module.sbeacon.aws_s3_bucket_ownership_controls.dataportal_bucket_ownership_controls must be replaced
-/+ resource "aws_s3_bucket_ownership_controls" "dataportal_bucket_ownership_controls" {
      ~ bucket = "gaspi-dataportal-20250110044710445000000002" -> (known after apply) # forces replacement
      ~ id     = "gaspi-dataportal-20250110044710445000000002" -> (known after apply)

        # (1 unchanged block hidden)
    }

  # module.sbeacon.aws_s3_bucket_ownership_controls.lambda_layers_bucket_ownership_controls must be replaced
-/+ resource "aws_s3_bucket_ownership_controls" "lambda_layers_bucket_ownership_controls" {
      ~ bucket = "gaspi-lambda-layers-20250110044710445300000003" -> (known after apply) # forces replacement
      ~ id     = "gaspi-lambda-layers-20250110044710445300000003" -> (known after apply)

        # (1 unchanged block hidden)
    }

  # module.sbeacon.aws_s3_bucket_ownership_controls.metadata_bucket_ownership_controls must be replaced
-/+ resource "aws_s3_bucket_ownership_controls" "metadata_bucket_ownership_controls" {
      ~ bucket = "gaspi-metadata-20250110044708770100000001" -> (known after apply) # forces replacement
      ~ id     = "gaspi-metadata-20250110044708770100000001" -> (known after apply)

        # (1 unchanged block hidden)
    }

  # module.sbeacon.aws_s3_bucket_ownership_controls.variants_bucket_ownership_controls must be replaced
-/+ resource "aws_s3_bucket_ownership_controls" "variants_bucket_ownership_controls" {
      ~ bucket = "gaspi-variants-20250110044711919900000004" -> (known after apply) # forces replacement
      ~ id     = "gaspi-variants-20250110044711919900000004" -> (known after apply)

        # (1 unchanged block hidden)
    }

  # module.sbeacon.aws_s3_bucket_versioning.dataportal-bucket must be replaced
-/+ resource "aws_s3_bucket_versioning" "dataportal-bucket" {
      ~ bucket                = "gaspi-dataportal-20250110044710445000000002" -> (known after apply) # forces replacement
      ~ id                    = "gaspi-dataportal-20250110044710445000000002" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ versioning_configuration {
          + mfa_delete = (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.security.aws_wafv2_web_acl.security-all-cloudfront will be updated in-place
  ~ resource "aws_wafv2_web_acl" "security-all-cloudfront" {
        id                          = "5bfb2e9b-9433-4a25-82ca-78803652307d"
        name                        = "security-all-cloudfront"
        tags                        = {}
        # (9 unchanged attributes hidden)

      - rule {
          - name     = "security-all-cloudfront-IP-rate-limiting" -> null
          - priority = 1 -> null

          - action {
              - block {
                }
            }

          - statement {
              - rate_based_statement {
                  - aggregate_key_type    = "IP" -> null
                  - evaluation_window_sec = 300 -> null
                  - limit                 = 10000 -> null
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "security-all-cloudfront-IP-rate-limiting-rule-metric" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      - rule {
          - name     = "security-all-cloudfront-common-ruleset" -> null
          - priority = 2 -> null

          - override_action {
              - none {}
            }

          - statement {
              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesCommonRuleSet" -> null
                  - vendor_name = "AWS" -> null
                    # (1 unchanged attribute hidden)

                  - rule_action_override {
                      - name = "SizeRestrictions_BODY" -> null

                      - action_to_use {
                          - count {
                            }
                        }
                    }
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "security-all-cloudfront-common-ruleset-rule-metric" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      + rule {
          + name     = "security-all-cloudfront-IP-rate-limiting"
          + priority = 1

          + action {
              + block {
                }
            }

          + statement {
              + rate_based_statement {
                  + aggregate_key_type    = "IP"
                  + evaluation_window_sec = 300
                  + limit                 = 1000
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "security-all-cloudfront-IP-rate-limiting-rule-metric"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "security-all-cloudfront-common-ruleset"
          + priority = 2

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesCommonRuleSet"
                  + vendor_name = "AWS"
                    # (1 unchanged attribute hidden)
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "security-all-cloudfront-common-ruleset-rule-metric"
              + sampled_requests_enabled   = true
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.svep[0].data.archive_file.binaries_layer will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "binaries_layer" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "svep/binaries.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "svep/layers/binaries/"
      + type                = "zip"
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-concatPages will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-concatPages" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:307946671795:svep-backend-concatPages",
              + "arn:aws:sns:ap-southeast-3:307946671795:svep-backend-sendJobEmail",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-regions-20241204060928215800000001/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-regions-20241204060928215800000001",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-clinic-jobs",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:307946671795:function:cognito-sendSvepJobEmail",
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + "arn:aws:cognito-idp:ap-southeast-3:307946671795:userpool/ap-southeast-3_1pggQ2ofX",
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-createPages will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-createPages" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:307946671795:svep-backend-concatPages",
              + "arn:aws:sns:ap-southeast-3:307946671795:svep-backend-createPages",
              + "arn:aws:sns:ap-southeast-3:307946671795:svep-backend-sendJobEmail",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-regions-20241204060928215800000001/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-regions-20241204060928215800000001/*",
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-regions-20241204060928215800000001",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-clinic-jobs",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:307946671795:function:cognito-sendSvepJobEmail",
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + "arn:aws:cognito-idp:ap-southeast-3:307946671795:userpool/ap-southeast-3_1pggQ2ofX",
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-getResultsURL will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-getResultsURL" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:BatchGetItem",
              + "dynamodb:BatchWriteItem",
              + "dynamodb:DeleteItem",
              + "dynamodb:DescribeTable",
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-project-users",
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-initQuery will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-initQuery" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:307946671795:svep-backend-concatStarter",
              + "arn:aws:sns:ap-southeast-3:307946671795:svep-backend-queryVCF",
              + "arn:aws:sns:ap-southeast-3:307946671795:svep-backend-sendJobEmail",
            ]
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-temp-20241204060929941500000004/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:BatchGetItem",
              + "dynamodb:BatchWriteItem",
              + "dynamodb:DeleteItem",
              + "dynamodb:DescribeTable",
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-project-users",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-clinic-jobs",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:307946671795:function:cognito-sendSvepJobEmail",
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + "arn:aws:cognito-idp:ap-southeast-3:307946671795:userpool/ap-southeast-3_1pggQ2ofX",
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-qcFigures will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-qcFigures" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-temp-20241204060929941500000004/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-references-20241204060930099700000005/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:ListBucket",
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-queryVCF will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-queryVCF" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:307946671795:svep-backend-queryGTF",
              + "arn:aws:sns:ap-southeast-3:307946671795:svep-backend-queryVCF",
              + "arn:aws:sns:ap-southeast-3:307946671795:svep-backend-queryVCFsubmit",
              + "arn:aws:sns:ap-southeast-3:307946671795:svep-backend-sendJobEmail",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-temp-20241204060929941500000004/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-clinic-jobs",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:307946671795:function:cognito-sendSvepJobEmail",
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + "arn:aws:cognito-idp:ap-southeast-3:307946671795:userpool/ap-southeast-3_1pggQ2ofX",
            ]
        }
    }

  # module.svep[0].aws_api_gateway_method_settings.VPApi will be updated in-place
  ~ resource "aws_api_gateway_method_settings" "VPApi" {
        id          = "zcxwlssuc0-prod-*/*"
        # (3 unchanged attributes hidden)

      ~ settings {
          ~ throttling_burst_limit                     = 1000 -> 100
          ~ throttling_rate_limit                      = 100 -> 10
            # (8 unchanged attributes hidden)
        }
    }

  # module.svep[0].aws_cloudwatch_event_rule.delete_clinical_trigger will be destroyed
  # (because aws_cloudwatch_event_rule.delete_clinical_trigger is not in configuration)
  - resource "aws_cloudwatch_event_rule" "delete_clinical_trigger" {
      - arn                 = "arn:aws:events:ap-southeast-3:307946671795:rule/svep_delete_clinical_trigger" -> null
      - description         = "A scheduled trigger that checks for pending jobs in clinical workflows and deletes them." -> null
      - event_bus_name      = "default" -> null
      - force_destroy       = false -> null
      - id                  = "svep_delete_clinical_trigger" -> null
      - is_enabled          = true -> null
      - name                = "svep_delete_clinical_trigger" -> null
      - schedule_expression = "cron(0 16 * * ? *)" -> null
      - state               = "ENABLED" -> null
      - tags                = {} -> null
      - tags_all            = {} -> null
        # (2 unchanged attributes hidden)
    }

  # module.svep[0].aws_cloudwatch_event_target.delete_clinical_trigger will be destroyed
  # (because aws_cloudwatch_event_target.delete_clinical_trigger is not in configuration)
  - resource "aws_cloudwatch_event_target" "delete_clinical_trigger" {
      - arn            = "arn:aws:lambda:ap-southeast-3:307946671795:function:svep-backend-deleteClinicalWorkflow" -> null
      - event_bus_name = "default" -> null
      - force_destroy  = false -> null
      - id             = "svep_delete_clinical_trigger-lambda-deleteClinicalWorkflow" -> null
      - rule           = "svep_delete_clinical_trigger" -> null
      - target_id      = "lambda-deleteClinicalWorkflow" -> null
        # (3 unchanged attributes hidden)
    }

  # module.svep[0].aws_lambda_layer_version.binaries_layer must be replaced
+/- resource "aws_lambda_layer_version" "binaries_layer" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_binaries_layer:41" -> (known after apply)
      ~ code_sha256                 = "bQSTbkqTmnpavpQS3OL3SWIZ8QntO4G/1cIzNMxJ13Y=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-06-04T02:16:56.616+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_binaries_layer:41" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_binaries_layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "Ru84te7hPeNx4OYtEbgj0UsR0HOVrL2gxmonp+EYsZ0Ig/YlNn+OEyM9rE6VFt0hFmB1bgxAmpe5f7LT0/qMeA==" -> (known after apply) # forces replacement
      ~ source_code_size            = 17636130 -> (known after apply)
      ~ version                     = "41" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.svep[0].aws_lambda_permission.cloudwatch_delete_clinical_workflow_invoke_permission will be destroyed
  # (because aws_lambda_permission.cloudwatch_delete_clinical_workflow_invoke_permission is not in configuration)
  - resource "aws_lambda_permission" "cloudwatch_delete_clinical_workflow_invoke_permission" {
      - action              = "lambda:InvokeFunction" -> null
      - function_name       = "svep-backend-deleteClinicalWorkflow" -> null
      - id                  = "CloudwatchDeleteClinicalWorkflowAllowInvoke" -> null
      - principal           = "events.amazonaws.com" -> null
      - source_arn          = "arn:aws:events:ap-southeast-3:30794
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.